In [1]:
import pandas as pd

In [2]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df = pd.read_csv('example')

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df.to_csv('MY_CSV',index=False)

In [6]:
pd.read_csv('MY_CSV')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)

In [27]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [28]:
data = pd.read_html('https://www.bankrate.com/banking/list-of-failed-banks/')

In [41]:
data[7].head(10)

,Failed banks,Date closed,Estimated cost to DIF ($ millions)
0,"Northern Star Bank, Mankato, MN",12/19/2014,5.9
1,"Frontier Bank, FSB D/B/A El Paseo Bank, Palm D...",11/07/2014,4.7
2,"The National Republic Bank of Chicago, Chicago",10/24/2014,111.6
3,"NBRS Financial, Rising Sun, MD",10/17/2014,24.3
4,"GreenChoice Bank, Chicago",07/25/2014,14.2
5,"Eastside Commercial Bank, Conyers, GA",07/18/2014,33.9
6,"The Freedom State Bank, Freedom, OK",06/27/2014,5.8
7,"Valley Bank, Fort Lauderdale, FL",06/20/2014,7.7
8,"Valley Bank, Moline, IL",06/20/2014,51.4
9,"Slavie Federal Savings Bank, Bel Air, MD",05/30/2014,6.6

In [42]:
from sqlalchemy import create_engine

In [43]:
engine = create_engine('sqlite:///:memory:')

In [44]:
df.to_sql('my_sql_table',engine)

In [46]:
pd.read_sql('my_sql_table',engine)

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15